# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
ch: 9
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Input_agent, []] 
  - [0, 1, t_head, [64]] 
  - [0, 1, A_head, [32]] 
  - [0, 1, First_Conv, [64, 3, 2]] # 3-P1/2

  - [1, 1, t_block, [64]] # (256*0.25)
  - [2, 1, A_block, [64, 1]] 
  - [-3, 1, Conv, [128, 3, 2]] # 6-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [[-1, -4, -3], 1, Concat, [1]]
  - [-1, 1, frequent_block, [256, 0.25]] # 9

  - [-6, 1, t_block, [128]] # (512*0.25)
  - [2, 1, A_block, [64, 2]] 
  - [-3, 1, Conv, [256, 3, 2]] # 12-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [[-1, -4, -3], 1, Concat, [1]]
  - [-1, 1, frequent_block, [512, 0.25]] # 15

  - [-6, 1, t_block, [256]] # (512*0.5)
  - [2, 1, A_block, [64, 3]] 
  - [-3, 1, Conv, [512, 3, 2]] # 18-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [[-1, -4, -3], 1, Concat, [1]]
  - [-1, 1, frequent_block, [512]] # 21

  - [-6, 1, t_block, [512]] # (1024*0.5)
  - [2, 1, A_block, [64, 4]] 
  - [-3, 1, Conv, [1024, 3, 2]] # 24-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [[-1, -4, -3], 1, Concat, [1]]
  - [-1, 1, frequent_block, [1024]] # 27

  - [-1, 1, SPPF, [1024, 5]] # 28
  - [-1, 2, C2PSA, [1024]] # 29

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 21], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 32

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 15], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 35 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 32], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 38 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 29], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [1024, True]] # 41 (P5/32-large)

  - [[35, 38, 41], 1, Detect, [nc]] # Detect(P3, P4, P5)
